[
  {
    "id": 3616,
    "date": "2024-04-03T13:15:36",
    "status": "publish",
    "title": "Как сделать компонент TextField в Material UI маленьким",
    "excerpt": "<p>Чтобы изменить размер компонента TextField в Material UI, вы можете сделать несколько вещей. Базовая модификация очевидна, но другие не так просты. По умолчанию компонент TextField довольно большой, и сделать его меньше &#8212; обычная задача.</p>\n",
    "link": "https://markimarta.ru/dev/htmlcss/kak-sdelat-komponent-textfield-v-material-ui-malenkim.html"
  },
  {
    "id": 3609,
    "date": "2024-03-27T10:36:39",
    "status": "publish",
    "title": "Сделать экспорт в Excel – простой способ на React",
    "excerpt": "<p>Данные на сайтах часто выкладываются в красивом, но не всегда удобном формате. В Excel можно обработать данные &#8212; сортировать, фильтровать, делать расчеты, подготовить статистику или отчет с помощью сводных таблиц – очень много чего. Базовая версия описанного ниже экспорта в Excel из приложения React потребует не более 5 минут.</p>\n",
    "link": "https://markimarta.ru/dev/js/sdelat-eksport-v-excel-prostoj-sposob-na-react.html"
  },
  {
    "id": 3602,
    "date": "2024-03-13T13:50:00",
    "status": "publish",
    "title": "Как уменьшить размер презентации PowerPoint",
    "excerpt": "<p>Дочка делала в школе презентацию в PowerPoint. Техническое требование к презентации – не более 15 Мб, а у нее получилось 20. Презентация состояла из 10 слайдов без видео и музыки, потому было немного удивительно, что файл такого размера. В течение буквально 30 секунд размер презентации был уменьшен в 10 раз, при этом на количестве слайдов [&hellip;]</p>\n",
    "link": "https://markimarta.ru/windowsos/msoffice/kak-umenshit-razmer-prezentacii-powerpoint.html"
  },
  {
    "id": 3593,
    "date": "2024-02-08T12:28:42",
    "status": "publish",
    "title": "Как получить N записей в запросе со смещением для постраничного вывода",
    "excerpt": "<p>Когда работаешь с очень большим объемом данных, то может не получится сделать постраничный вывод на стороне клиента и придется дробить запросы на вывод N записей. Ниже пример SQL запроса, который позволит это сделать. Код для MSSQL сервера (Transact-SQL).</p>\n",
    "link": "https://markimarta.ru/dev/ms-sql/kak-poluchit-n-zapisej-v-zaprose-so-smeshheniem-dlya-postranichnogo-vyvoda.html"
  },
  {
    "id": 3585,
    "date": "2024-01-29T12:52:31",
    "status": "publish",
    "title": "Push, pop, shift, unshift - простые методы по добавлению и удалению элементов массива в Javascript / Typescript",
    "excerpt": "<p>Очередная шпаргалка для Fullstack разработчика &#8212; сводная таблица по добавлению и удалению элементов массива. Когда надо добавить элемент в начало массива, когда в конец, или наоборот &#8212; удалить элемент. Ниже 4 базовых метода для добавления или удаления элементов.</p>\n",
    "link": "https://markimarta.ru/dev/js/push-pop-shift-unshift-prostye-metody-po-dobavleniyu-i-udaleniyu-elementov-massiva-v-javascript-typescript.html"
  },
  {
    "id": 3566,
    "date": "2024-01-04T18:33:11",
    "status": "publish",
    "title": "В C# вывести дерево файлов и папок",
    "excerpt": "<p>Для отслеживания изменений в списке файлов решил написать утилиту, которая будет каждый день записывать дерево папок и файлов, а потом сравнивать с предыдущим значением. Пока думал, как написать рекурсивную функцию по построению дерева, нашел более просто решение.</p>\n",
    "link": "https://markimarta.ru/dev/asp-net-c/csharp_fileandfoldertree.html"
  },
  {
    "id": 3559,
    "date": "2023-12-13T11:51:26",
    "status": "publish",
    "title": "Как встроить HTML, JavaScript и CSS код в страницу сайта на WordPress",
    "excerpt": "<p>Очень долго я использовал WordPress только для публикации статических постов, в которых записывал свои находки по разработке и коду, по использованию программ, делился опытом по использованию тех или иных устройств. Очень мне не хватало в WordPress возможности вставить динамический код – создать форму, добавить обработчик и т.д.</p>\n",
    "link": "https://markimarta.ru/crm/wordpress/kak-vstroit-html-javascript-i-css-kod-v-stranicu-sajta-na-wordpress.html"
  },
  {
    "id": 3553,
    "date": "2023-11-21T13:05:55",
    "status": "publish",
    "title": "Как я сделал автоматическую съемку фото на веб камере ноутбука из консоли Linux",
    "excerpt": "<p>Для своих личных задач я сделал из старого ноутбука с I5 3-го поколения и 16GB оперативной памяти домашний сервер. Установил на него Debian, даже настроил на нем аналог RDP для линукса &#8212; XFCE. На нем работает nginx и еще некоторые домашние роботы 🙂 Но очень хотелось еще сделать небольшое DIY видеонаблюдение из него. Инструменты: Debian, [&hellip;]</p>\n",
    "link": "https://markimarta.ru/linux/kak-ya-delal-avtomaticheskuyu-semku-foto-na-veb-kamere-noutbuka-iz-konsoli-linux.html"
  },
  {
    "id": 3540,
    "date": "2023-11-16T19:11:50",
    "status": "publish",
    "title": "Поменять цвет комментариев в работе с PDF в Foxit Reader",
    "excerpt": "<p>При выполнении домашнего задания по немецкому, я часто пишу ответы поверх текста в PDF версии учебника. Используемая программа для просмотра PDF – Foxit Reader. В принципе, такая задача актуальна много для чего.</p>\n",
    "link": "https://markimarta.ru/windowsos/pomenyat-cvet-kommentariev-v-rabote-s-pdf-v-foxit-reader.html"
  },
  {
    "id": 3535,
    "date": "2023-11-15T14:12:34",
    "status": "publish",
    "title": "Скрыть чаты WhatsApp в IPhone или телефонах с ОС Android",
    "excerpt": "<p>Чтобы скрыть чат в WhatsApp, при этом не удалив из него сообщения, можно перенести его в архив. Для этого выберите название чата (контакт или группу), зажмите на 2-3 секунды на него, после чего&nbsp; в открывшемся контекстном меню выберите пункт Archive.</p>\n",
    "link": "https://markimarta.ru/devices/skryt-chaty-v-whatsapp-v-iphone-ili-telefonax-s-os-android.html"
  }
]